SixtyFourGua = {
    "menu": ("次序",
             "卦象",
             "卦名",
             "卦辞",
             "初爻辞",
             "二爻辞",
             "三爻辞",
             "四爻辞",
             "五爻辞",
             "上爻辞",
             "用九、六",
             "文言",
             "主爻"),
    "111111": (1,
               "—————\
                —————\
                —————\
                —————\
                —————\
                —————",
               "乾",
               "元亨利贞。\
                彖曰：大哉乾元，万物资始，乃统天。云行雨施，品物流形。大明终始，六位时成。时乘六龙以御天。乾道变化，各正性命。保合大和，乃利贞。首出庶物，万国咸宁。\
                象曰：天行健，君子以自强不息",
               "初九：潜龙勿用。\
                象曰：潜龙勿用，阳在下也。",
               "九二：见龙在田，利见大人。\
                象曰：见龙在田，德施普也。",
               "九三：君子终日乾乾，夕惕若；厉，无咎。\
                象曰：终日乾乾，反复道也。",
               "九四：或跃在渊，无咎。\
                象曰：或跃在渊，进无咎也。",
               "九五：飞龙在天，利见大人。\
                象曰：飞龙在天，大人造也。",
               "上九：亢龙有悔。\
                象曰：亢龙有悔，盈不可久也。",
               "用九：见群龙无首，吉。",
               "文言曰：『元者，善之长也；亨者，嘉之会也；利者，义之和也；贞者，事之干也。君子体仁，足以长人；嘉会，足以合礼；利物，足以和义；贞固，足以干事。君子行此四德者，故曰：乾，元亨利贞。』\
                初九曰『潜龙勿用。』何谓也？子曰『龙德而隐者也。不易乎世，不成乎名，遁世无闷，不见是而无闷。乐则行之，忧则违之，确乎其不可拔，潜龙也。』\
                九二曰『见龙在田，利见大人。』何谓也？子曰『龙德而正中者也。庸言之信，庸行之谨，闲邪存其诚，德博而化。易曰「见龙在田，利见大人。」君德也。』\
                九三曰『君子终日乾乾，夕惕若，厉无咎。』何谓也？子曰『君子进德修业，忠信，所以进德也。修辞立其诚，所以居业也。知至至之，可与言几也。知终终之，可与存义也。是故，居上位而不骄，在下位而不忧。故乾乾，因其时而惕，虽危而无咎矣。』\
                九四曰『或跃在渊，无咎。』何谓也？子曰『上下无常，非为邪也。进退无恒，非离群也。君子进德修业，欲及时也，故无咎。』\
                九五曰『飞龙在天，利见大人。』何谓也？子曰『同声相应，同气相求；水就湿，火就燥；云从龙，风从虎。圣人作，而万物睹，本乎天者亲上，本乎地者亲下，则各从其类也』\
                上九曰『亢龙有悔。』何谓也？子曰『贵而无位，高而无民，贤人在下而无辅，是以动而有悔也。』\
                潜龙勿用，下也。见龙在田，时舍也。终日乾乾，行事也。或跃在渊，自试也。飞龙在天，上治也。亢龙有悔，穷之灾也。乾元用九，天下治也。\
                潜龙勿用，阳气潜藏。见龙在田，天下文明。终日乾乾，与时偕行。或跃在渊，乾道乃革。飞龙在天，乃位乎天德。亢龙有悔，与时偕极。乾元用九，乃见天则。\
                乾元者，始而亨者也。利贞者，性情也。乾始能以美利利天下，不言所利。大矣哉！大哉乾乎？刚健中正，纯粹精也。六爻发挥，旁通情也。时乘六龙，以御天也。云行雨施，天下平也。\
                君子以成德为行，日可见之行也。潜之为言也，隐而未见，行而未成，是以君子弗用也。\
                君子学以聚之，问以辨之，宽以居之，仁以行之。易曰『见龙在田，利见大人。』君德也。\
                九三，重刚而不中，上不在天，下不在田。故乾乾，因其时而惕，虽危无咎矣。\
                九四，重刚而不中，上不在天，下不在田，中不在人，故或之。或之者，疑之也，故无咎。\
                夫大人者，与天地合其德，与日月合其明，与四时合其序，与鬼神合其吉凶。先天下而天弗违，后天而奉天时。天且弗违，而况于人乎？况于鬼神乎？\
                亢之为言也，知进而不知退，知存而不知亡，知得而不知丧。其唯圣人乎？知进退存亡，而不失其正者，其唯圣人乎？",
               ""),

    "000000": (2,
               "—— ——\
                —— ——\
                —— ——\
                —— ——\
                —— ——\
                —— ——",
               "坤",
               "元，亨,利牝马之贞。君子有攸往，先迷后得主。利西南得朋，东北丧朋。安贞，吉\
                彖曰：至哉坤元，万物资生，乃顺承天。坤厚载物，德合无疆。含弘光大，品物咸亨。牝马地类，行地无疆，柔顺利贞。君子攸行，先迷失道，后顺得常。西南得朋，乃与类行；东北丧朋，乃终有庆。安贞之吉，应地无疆。\
                象曰：地势坤，君子以厚德载物。",
               "初六：履霜，坚冰至。\
                象曰：覆霜坚冰，阴始凝也。驯致其道，至坚冰也。",
               "六二：直方大，不习，无不利。\
                象曰：六二之动，直以方也。不习，无不利，地道光也",
               "六三：含章可贞，或从王事，无成有终。\
                象曰：含章可贞，以时发也；或从王事，知光大也。",
               "六四：括囊，无咎无誉。\
                象曰：括囊无咎，慎不害也。",
               "六五：黄裳，元吉。\
                象曰：黄裳元吉，文在中也。",
               "上六：龙战于野，其血玄黄。\
                象曰：龙战于野，其道穷也。",
                "用六，利永贞。\
                象曰：用六永贞，以大终也。",
               "文言曰：坤至柔而动也刚，至静而德方，后得主而有常，含万物而化光。坤其道顺乎？承天而时行。\
                积善之家必有余庆，积不善之家必有余殃。臣弑其君，子弑其父，非一朝一夕之故，其所由来者渐矣，由辨之不早辨也。易曰：「覆霜坚冰至。」盖言顺也。\
                直其正也，方其义也。君子敬以直内，义以方外，敬义立，而德不孤。「直方大，不习，无不利」；则不疑其所行也。\
                阴虽有美，含之；以从王事，弗敢成也。地道也，妻道也，臣道也。地道无成，而代有终也。\
                天地变化，草木蕃；天地闭，贤人隐。易曰：「括囊；无咎，无誉。」盖言谨也。\
                君子黄中通理，正位居体，美在其中，而畅于四支，发于事业，美之至也。\
                阴疑于阳，必战。为其嫌于无阳也，故称龙焉。犹未离其类也，故称血焉。夫玄黄者，天地之杂也，天玄而地黄。", 
               ""),

    "100010": (3,
                "—— ——\
                 —————\
                 —— ——\
                 —— ——\
                 —— ——\
                 —————",
               "屯 水雷屯，坎上震下",
               "元亨利贞。勿用有攸往，利建侯。\
                彖曰：屯，刚柔始交而难生，动乎险中，大亨贞。雷雨之动满盈，天造草昧，宜建侯而不宁。\
                象曰：云雷屯，君子以经纶。",
               "初九：磐桓，利居贞，利建侯。\
                象曰：虽磐桓，志行正也。以贵下贱，大得民也。",
               "六二：屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。\
                象曰:六二之难，乘刚也。十年乃字，反常也。",
               "六三：即鹿无虞，唯入于林中，君子几，不如舍，往吝。\
                象曰：即鹿无虞，以从禽也。君子舍之，往吝，穷也。",
               "六四：乘马班如，求婚媾，往吉，无不利。\
                象曰：求而往，明也。",
               "九五：屯其膏，小贞吉，大贞凶。\
                象曰：屯其膏，施未光也。",
               "上六：乘马班如，泣血涟如。\
                象曰：泣血涟如，何可长也？",
               "",
               "",
               ""),

    "010001": (4,
               "—————\
                —— ——\
                —— ——\
                —— ——\
                —————\
                —— ——",
               "蒙 山水蒙，艮上坎下",
               "蒙,亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。\
                彖曰：蒙，山下有险，险而止，蒙。蒙亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。初筮告，以刚中也。再三渎，渎则不告，渎蒙也。蒙以养正，圣功也。\
                象曰：山下出泉，蒙。君子以果行育德。",
               "初六：发蒙，利用刑人，用说桎梏。以往，吝。\
                象曰：利用刑人，以正法也。",
               "九二：包蒙，吉，纳妇吉。子克家。\
                象曰：子克家，刚柔接也。",
               "六三：勿用取女，见金夫，不有躬。无攸利\
                象曰：勿用取女，行不顺也。",
               "六四：困蒙，吝。\
                象曰：困蒙之吝，独远实也。",
               "六五：童蒙，吉。\
                象曰：童蒙之吉，顺以巽也。",
               "上九：击蒙，不利为寇，利御寇。\
                象曰：利用御寇，上下顺也。",
               "",
               "", 
               ""),

    "111010": (5,
               "—— ——\
                —————\
                —— ——\
                —————\
                —————\
                —————",               
               "需  水天需 坎上乾下",
               "需。有孚，光享。贞吉，利涉大川。\
                彖曰：需，须也。险在前也，刚健而不陷，其义不困穷矣。需，有孚，光享，贞吉。位乎天位，以正中也。利涉大川，往有功也。\
                象曰：云上于天，需。君子以饮食宴乐。",
               "初九：需于郊，利用恒，无咎。\
                象曰：需于郊，不犯难行也。利用恒，无咎，未失常也。",
               "九二：需于沙，小有言，终吉。\
                象曰：需于沙，衍在中也。虽小有言，以终吉也。",
               "九三：需于泥，致寇至。\
                象曰：需于泥，灾在外也。自我致寇，敬慎不败也。",
               "六四：需于血，出自穴。\
                象曰：需于血，顺以听也。",
               "九五：需于酒食，贞吉。\
                象曰：酒食贞吉，以中正也。",
               "上六：入于穴，有不速之客三人来，敬之终吉。\
                象曰：不速之客，敬之终吉。虽不当位，未大失也。",
               "",
               "", 
               ""),

    "010111": (6,
               "—————\
                —————\
                —————\
                —— ——\
                —————\
                —— ——",               
               "讼 天水讼  乾上坎下",
               "讼。有孚，窒惕，中吉，终凶。利见大人，不利涉大川。\
                彖曰：讼，上刚下险，险而健讼。讼，有孚，窒惕，中吉，刚来而得中也。终凶，讼不可成也。利见大人，尚中正也。不利涉大川，入于渊也。\
                象曰：天与水违行，讼。君子以作事谋始。",
               "初六：不永所事，小有言，终吉。\
                象曰：不永所事，讼不可长也。虽有小言，其辩明也。",
               "九二：不克讼，归而逋，其邑人三百户，无眚。\
                象曰：不克讼，归逋窜也。自下讼上，患至掇也。",
               "六三：食旧德，贞厉，终吉。或从王事，无成。\
                象曰：食旧德，从上吉也。",
               "九四：不克讼，复即命，渝安贞，吉。\
                象曰：复即命，渝安贞，吉，不失也。",
               "九五：讼，元吉。\
                象曰：讼，元吉，以中正也。",
               "上九：或锡之鞶带，终朝三褫之。\
                象曰：以讼受服，亦不足敬也。",
               "",
               "",
               ""),

    "010000": (7,
               "—— ——\
                —— ——\
                —— ——\
                —— ——\
                —————\
                —— ——",                
               "师 地水师 坤上坎下",
               "师。贞，丈人吉，无咎。\
                彖曰：师，众也，贞正也。能以众正，可以王矣。刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣。\
                象曰：地中有水，师。君子以容民畜众。",
               "初六：师出以律，否藏，凶。\
                象曰：师出以律，失律凶也。",
               "九二：在师中，吉无咎，王三锡命。\
                象曰：在师中吉，承天宠也，王三锡命，怀万邦也。",
               "六三：师或舆尸，凶。\
                象曰：师或舆尸，大无功也。",
               "六四：师左次，无咎。\
                象曰：左次无咎，未失常也。",
               "六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。\
                象曰：长子帅师，以中行也。弟子舆尸，使不当也。",
               "上六：大君有命，开国承家，小人勿用。\
                象曰：大君有命，以正功也。小人勿用，必乱邦也。",
               "",
               "",
               ""),

    "000010": (8,
               "—— ——\
                —————\
                —— ——\
                —— ——\
                —— ——\
                —— ——",                 
               "比 水地比 坎上下坤",
               "比。吉。原筮，元永贞，无咎。不宁方来，后夫凶。\
                彖曰：比，吉也。比，辅也，下顺从也。原筮，元永贞，无咎，以刚中也。不宁方来，上下应也。后夫凶，其道穷也。\
                象曰：地上有水，比。先王以建万国，亲诸侯。",
               "初六：有孚，比之，无咎。有孚盈缶，终来有它吉。\
                象曰：比之初六，有它吉也。",
               "六二：比之自内，贞吉。\
                象曰：比之自内，不自失也。",
               "六三：比之匪人。\
                象曰：比之匪人，不亦伤乎。",
               "六四：外比之，贞吉。\
                象曰：外比于贤，以从上也。",
               "九五：显比，王用三驱，失前禽。邑人不诫，吉。\
                象曰：显比之吉，位正中也。舍逆取顺，失前禽也。邑人不诫，上使中也。",
               "上六：比之无首，凶。\
                象曰：比之无首，无所终也。",
               "",
               "",
               ""),

    "111011": (9,
               "—————\
                —————\
                —— ——\
                —————\
                —————\
                —————",                 
               "小畜  风天小畜 乾下巽上",
               "小畜。亨。密云不雨，自我西郊。\
                彖曰：小畜，柔得位而上下应之，曰小畜。健而巽，刚中而志行，乃亨。密云不雨，尚往也。自我西郊，施未行也。\
                象曰：风行天上，小畜。君子以懿文德。",
               "初九：复自道，何其咎？吉。\
                象曰：复自道，其义吉也。",
               "九二：牵复，吉。\
                象曰：牵复在中，亦不自失也。",
               "九三：舆说辐，夫妻反目。\
                象曰：夫妻反目，不能正室也。",
               "六四：有孚，血去惕出，无咎。\
                象曰：有孚惕出，上合志也。",
               "九五：有孚挛如，富以其邻。\
                象曰：有孚挛如，不独富也。",
               "上九：既雨既处，尚德载。妇贞厉。月几望，君子征凶。\
                象曰：既雨既处，德积载也。君子征凶，有所疑也。",
               "",
               "",
               ""),

    "110111": (10,
               "—————\
                —————\
                —————\
                —— ——\
                —————\
                —————",                 
               "履卦 天泽履 乾上兑下",
               "履。履虎尾，不咥人，亨。\
                彖曰：履，柔履刚也。说而应乎乾，是以履虎尾，不咥人。亨，刚中正，履帝位而不疚，光明也。\
                象曰：上天下泽，履。君子以辨上下，定民志。",
               "初九：素履，往无咎。\
                象曰：素履之往，独行愿也。",
               "九二：履道坦坦，幽人贞吉。\
                象曰：幽人贞吉，中不自乱也。",
               "六三：眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。\
                象曰：眇能视，不足以有明也。跛能履，不足以与行也。咥人之凶，位不当也。武人为于大君，志刚也。",
               "九四：履虎尾，愬愬，终吉。\
                象曰：愬愬终吉，志行也。",
               "九五：夬履，贞厉。\
                象曰：夬履贞厉。位正当也。",
               "上九：视履考祥，其旋元吉。\
                象曰：元吉在上，大有庆也。",
               "",
               "",
               ""),

    "111000": (11,
               "—— ——\
                —— ——\
                —— ——\
                —————\
                —————\
                —————",                  
               "泰 地天泰 乾下坤上",
               "泰。小往大来，吉亨。\
                彖曰：泰，小往大来，吉亨。则是天地交而万物通也；上下交而其志同也。内阳而外阴，内健而外顺，内君子而外小人。君子道长，小人道消也。\
                象曰：天地交，泰。后以财成天地之道，辅相天地之宜，以左右民。",
               "初九：拔茅，茹以其汇，征吉。\
                象曰：拔茅征吉，志在外也。",
               "九二：包荒，用冯河，不遐遗，朋忘，得尚于中行。\
                象曰：包荒，得尚于中行，以光大也。",
               "九三：无平不陂，无往不复，艰贞无咎。勿恤其孚。于食有福。\
                象曰：无往不复，天地际也。",
               "六四：翩翩不富以其邻，不戒以孚。\
                象曰：翩翩不富，皆失实也；不戒以孚，中心愿也。",
               "六五：帝乙归妹，以祉元吉。\
                象曰：以祉元吉，中以行愿也。",
               "上六：城复于隍，勿用师。自邑告命，贞吝。\
                象曰：城复于隍，其命乱也。",
               "",
               "", 
               ""),

    "000111": (12,
               "—————\
                —————\
                —————\
                —— ——\
                —— ——\
                —— ——",               
               "否 天地否  上乾下坤",
               "否。否之匪人。不利君子贞，大往小来。\
                彖曰：否之匪人，不利君子贞，大往小来。则是天地不交，而万物不通也；上下不交，而天下无邦也；内阴而外阳，内柔而外刚，内小人而外君子。小人道长，君子道消也。\
                象曰：天地不交，否。君子以俭德辟难，不可荣以禄。",
               "初六：拔茅，茹以其汇，贞吉，亨。\
                象曰：拔茅贞吉，志在君也。",
               "六二：包承，小人吉，大人否，亨。\
                象曰：大人否，亨，不乱群也。",
               "六三：包羞。\
                象曰：包羞，位不当也。",
               "九四：有命无咎，畴离祉。\
                象曰：有命无咎，志行也。",
               "九五：休否，大人吉。其亡其亡，系于苞桑。\
                象曰：大人之吉，位正当也",
               "上九：倾否，先否后喜。\
                象曰：否终则倾，何可长也？",
               "",
               "", 
               ""),

    "101111": (13,
               "—————\
                —————\
                —————\
                —————\
                —— ——\
                —————",                  
               "同人卦 天火同人 乾上离下",
               "同人：同人于野，亨。利涉大川，利君子贞。\
                彖曰：同人，柔得位得中，而应乎乾，曰同人。同人曰：“同人于野，亨。利涉大川。”乾行也。文明以健，中正而应，君子正也。唯君子为能通天下之志。\
                象曰：天与火，同人。君子以类族辨物。",
               "初九：同人于门，无咎。\
                象曰：出门同人，又谁咎也？",
               "六二：同人于宗，吝。\
                象曰：同人于宗，吝道也。",
               "九三：伏戎于莽，升其高陵，三岁不兴。\
                象曰：伏戎于莽，敌刚也。三岁不兴，安行也。",
               "九四：乘其墉，弗克攻，吉。\
                象曰：乘其墉，义弗克也；其吉，则困而反则也。",
               "九五：同人，先号咷而后笑，大师克相遇。\
                象曰：同人之先，以中直也。大师相遇，言相克也。",
               "上九：同人于郊，无悔。\
                象曰：同人于郊，志未得也。",
               "",
               "",
               ""),

    "111101": (14,
               "—————\
                —— ——\
                —————\
                —————\
                —————\
                —————",                  
               "大有卦 火天大有 离上乾下",
               "大有：元亨。\
                彖曰：大有，柔得尊位，大中而上下应之，曰大有。其德刚健而文明，应乎天而时行，是以元亨。\
                象曰：火在天上，大有。君子以遏恶扬善，顺天休命。",
               "初九：无交害，匪咎，艰则无咎。\
                象曰：大有初九，无交害也。",
               "九二：大车以载，有攸往，无咎。\
                象曰：大车以载，积中不败也。",
               "九三：公用亨于天子，小人弗克。\
                象曰：公用亨于天子，小人害也。",
               "九四：匪其彭，无咎。\
                象曰：匪其彭，无咎，明辨皙也。",
               "六五：厥孚交如，威如，吉。\
                象曰：厥孚交如，信以发志也；威如之吉，易而无备也。",
               "上九：自天佑之，吉无不利。\
                象曰：大有上吉，自天佑也。",
               "",
               "",
               ""),

    "001000": (15,
               "—— ——\
                —— ——\
                —— ——\
                —————\
                —— ——\
                —— ——",               
               "谦卦 地山谦 坤上艮下",
               "谦：亨。君子有终。\
                彖曰：谦亨。天道下济而光明，地道卑而上行。天道亏盈而益谦，地道变盈而流谦，人道恶盈而好谦。谦尊而光。卑而不可逾，君子之终也。\
                象曰：地中有山，谦。君子以裒多益寡，称物平施。",
               "初六：谦谦君子，用涉大川，吉。\
                象曰：谦谦君子，卑以自牧也。",
               "六二：鸣谦，贞吉。\
                象曰：鸣谦贞吉，中心得也。",
               "九三：劳谦君子，有终，吉。\
                象曰：劳谦君子，万民服也。",
               "六四：无不利，㧑谦。\
                象曰：无不利，㧑谦，不违则也。",
               "六五：不富以其邻，利用侵伐，无不利。\
                象曰：利用侵伐，征不服也。",
               "上六：鸣谦，利用行师，征邑国。\
                象曰：鸣谦，志未得也；可用行师，征邑国也。",
               "",
               "",
               ""),

    "000100": (16,
               "—— ——\
                —— ——\
                —————\
                —— ——\
                —— ——\
                —— ——",               
               "豫卦 雷天豫 震上乾下",
               "豫：利建侯行师。\
                彖曰：豫，刚应而志行，顺以动，豫。豫，顺以动，故天地如之，而况建侯行师乎！天地以顺动，故日月不过而四时不忒。圣人以顺动，则刑罚清而民服。豫之时义大矣哉！\
                象曰：雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。",
               "初六：鸣豫，凶。\
                象曰：初六鸣豫，志穷凶也。",
               "六二：介于石，不终日，贞吉。\
                象曰：不终日，贞吉，以中正也。",
               "六三：盱豫，悔。迟有悔。\
                象曰：盱豫有悔，位不当也。",
               "九四：由豫。大有得。勿疑，朋盍簪。\
                象曰：由豫大有得，志大行也。",
               "六五：贞疾，恒不死。\
                象曰：六五贞疾，乘刚也。恒不死，中未亡也。",
               "上六：冥豫，成有渝，无咎。\
                象曰：冥豫在上，何可长也？",
               "",
               "",
               ""),

    "100110": (17,"随卦","随,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，随。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011001": (18,"蛊卦","蛊,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，蛊。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110000": (19,"临卦","临,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，临。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000011": (20,"观卦","观,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，观。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100101": (21,"噬嗑卦","噬嗑,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，噬嗑。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101001": (22,"贲卦","贲,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，贲。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000001": (23,"剥卦","剥,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，剥。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100000": (24,"复卦","复,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，复。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100111": (25,"无妄卦","无妄,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，无妄。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111001": (26,"大畜卦","大畜,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大畜。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100001": (27,"颐卦","颐,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，颐。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011110": (28,"大过卦","大过,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大过。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010010": (29,"习坎卦","习坎,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，习坎。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101101": (30,"离卦","离,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，离。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001110": (31,"咸卦","咸,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，咸。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011100": (32,"恒卦","恒,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，恒。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001111": (33,"遁卦","遁,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，遁。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111100": (34,"大壮卦","大壮,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大壮。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000101": (35,"晋卦","晋,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，晋。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101000": (36,"明夷卦","明夷,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，明夷。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101011": (37,"家人卦","家人,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，家人。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110101": (38,"睽卦","睽,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，睽。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001010": (39,"蹇卦","蹇,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，蹇。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010100": (40,"解卦","解,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，解。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110001": (41,"损卦","损,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，损。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100011": (42,"益卦","益,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，益。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111110": (43,"夬卦","夬,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，夬。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011111": (44,"姤卦","姤,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，姤。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000110": (45,"萃卦","萃,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，萃。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011000": (46,"升卦","升,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，升。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010110": (47,"困卦","困,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，困。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011010": (48,"井卦","井,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，井。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101110": (49,"革卦","革,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，革。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011101": (50,"鼎卦","鼎,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，鼎。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100100": (51,"震卦","震,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，震。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001001": (52,"艮卦","艮,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，艮。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001011": (53,"渐卦","渐,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，渐。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110100": (54,"归妹卦","归妹,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，归妹。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101100": (55,"丰卦","丰,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，丰。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001101": (56,"旅卦","旅,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，旅。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011011": (57,"巽卦","巽,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，巽。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110110": (58,"兑卦","兑,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，兑。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010011": (59,"涣卦","涣,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，涣。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110010": (60,"节卦","节,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，节。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110011": (61,"中孚卦","中孚,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，中孚。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001100": (62,"小过卦","小过,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，小过。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101010": (63,"既济卦","既济,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，既济。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010101": (64,"未济卦","未济,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，未济。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),

    "default": ("未找到该卦信息",),
}


def JieGua(GuaXiangData,FuGuaData,BianGuaData,HuGuaData,YaoWeiData):
    print(SixtyFourGua["menu"])
    if GuaXiangData in SixtyFourGua:
        print(f"卦象：{SixtyFourGua[GuaXiangData]} \n 爻位：{SixtyFourGua[GuaXiangData][YaoWeiData+3]}")
        DrawTheGua(GuaXiangData)
    else:
        print (f"卦象{SixtyFourGua.get(GuaXiangData, SixtyFourGua["default"])}")
        DrawTheGua(GuaXiangData)
    '''
    if FuGuaData in SixtyFourGua:
        print(f"覆卦：{SixtyFourGua.get(FuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(FuGuaData)
    else:
        print(f"覆卦：{SixtyFourGua.get(FuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(FuGuaData)
    
    if BianGuaData in SixtyFourGua:
        print(f"变卦：{SixtyFourGua.get(BianGuaData, SixtyFourGua["default"])}")
        DrawTheGua(BianGuaData)
    else:
        print(f"变卦：{SixtyFourGua.get(BianGuaData, SixtyFourGua["default"])}")
        DrawTheGua(BianGuaData)
    
    if HuGuaData in SixtyFourGua:
        print(f"互卦：{SixtyFourGua.get(HuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(HuGuaData)
    else:
        print(f"互卦：{SixtyFourGua.get(HuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(HuGuaData)
    '''

    return None

def DrawTheGua(GuaData):
    print("Drawing the Gua...")
    for i in range(5, -1, -1):  # Loop from 5 to 0 (5 lines)
        if GuaData[i] == '1':
            print("—————", end='\n')  # Yang line
        else:
            print("—— ——", end='\n')  # Yin line
    print()  # New line after drawing the Gua