SixtyFourGua = {
    "menu": ("次序",
             "卦名",
             "卦辞",
             "初爻辞",
             "二爻辞",
             "三爻辞",
             "四爻辞",
             "五爻辞",
             "上爻辞",
             "用九、六",
             "文言",
             "主爻"),
    "111111": (1,
               "乾",
               "元亨利贞。\
                彖曰：大哉乾元，万物资始，乃统天。云行雨施，品物流形。大明终始，六位时成。时乘六龙以御天。乾道变化，各正性命。保合大和，乃利贞。首出庶物，万国咸宁。\
                象曰：天行健，君子以自强不息",
               "初九：潜龙勿用。\
                象曰：潜龙勿用，阳在下也。",
               "九二：见龙在田，利见大人。\
                象曰：见龙在田，德施普也。",
               "九三：君子终日乾乾，夕惕若；厉，无咎。\
                象曰：终日乾乾，反复道也。",
               "九四：或跃在渊，无咎。\
                象曰：或跃在渊，进无咎也。",
               "九五：飞龙在天，利见大人。\
                象曰：飞龙在天，大人造也。",
               "上九：亢龙有悔。\
                象曰：亢龙有悔，盈不可久也。",
               "用九：见群龙无首，吉。",
               "文言曰：『元者，善之长也；亨者，嘉之会也；利者，义之和也；贞者，事之干也。君子体仁，足以长人；嘉会，足以合礼；利物，足以和义；贞固，足以干事。君子行此四德者，故曰：乾，元亨利贞。』\
                初九曰『潜龙勿用。』何谓也？子曰『龙德而隐者也。不易乎世，不成乎名，遁世无闷，不见是而无闷。乐则行之，忧则违之，确乎其不可拔，潜龙也。』\
                九二曰『见龙在田，利见大人。』何谓也？子曰『龙德而正中者也。庸言之信，庸行之谨，闲邪存其诚，德博而化。易曰「见龙在田，利见大人。」君德也。』\
                九三曰『君子终日乾乾，夕惕若，厉无咎。』何谓也？子曰『君子进德修业，忠信，所以进德也。修辞立其诚，所以居业也。知至至之，可与言几也。知终终之，可与存义也。是故，居上位而不骄，在下位而不忧。故乾乾，因其时而惕，虽危而无咎矣。』\
                九四曰『或跃在渊，无咎。』何谓也？子曰『上下无常，非为邪也。进退无恒，非离群也。君子进德修业，欲及时也，故无咎。』\
                九五曰『飞龙在天，利见大人。』何谓也？子曰『同声相应，同气相求；水就湿，火就燥；云从龙，风从虎。圣人作，而万物睹，本乎天者亲上，本乎地者亲下，则各从其类也』\
                上九曰『亢龙有悔。』何谓也？子曰『贵而无位，高而无民，贤人在下而无辅，是以动而有悔也。』\
                潜龙勿用，下也。见龙在田，时舍也。终日乾乾，行事也。或跃在渊，自试也。飞龙在天，上治也。亢龙有悔，穷之灾也。乾元用九，天下治也。\
                潜龙勿用，阳气潜藏。见龙在田，天下文明。终日乾乾，与时偕行。或跃在渊，乾道乃革。飞龙在天，乃位乎天德。亢龙有悔，与时偕极。乾元用九，乃见天则。\
                乾元者，始而亨者也。利贞者，性情也。乾始能以美利利天下，不言所利。大矣哉！大哉乾乎？刚健中正，纯粹精也。六爻发挥，旁通情也。时乘六龙，以御天也。云行雨施，天下平也。\
                君子以成德为行，日可见之行也。潜之为言也，隐而未见，行而未成，是以君子弗用也。\
                君子学以聚之，问以辨之，宽以居之，仁以行之。易曰『见龙在田，利见大人。』君德也。\
                九三，重刚而不中，上不在天，下不在田。故乾乾，因其时而惕，虽危无咎矣。\
                九四，重刚而不中，上不在天，下不在田，中不在人，故或之。或之者，疑之也，故无咎。\
                夫大人者，与天地合其德，与日月合其明，与四时合其序，与鬼神合其吉凶。先天下而天弗违，后天而奉天时。天且弗违，而况于人乎？况于鬼神乎？\
                亢之为言也，知进而不知退，知存而不知亡，知得而不知丧。其唯圣人乎？知进退存亡，而不失其正者，其唯圣人乎？",
               ""),

    "000000": (2,
               "坤卦",
               "坤,元亨,利牝马之贞。君子有攸往，先迷后得主。利西南得朋，东北丧朋。安贞吉",
               "初六：履霜，坚冰至。",
               "六二：直方大，不习,无不利。",
               "六三：含章可贞，或从王事，无成有终。",
               "六四：括囊，无咎。","六五：黄裳，元吉。",
               "上六：龙战于野，其血玄黄。",
               "象曰：地势坤，君子以厚德载物。",
               "文言曰：元亨利贞。", ""),
    "100010": (3,"屯卦","屯,元亨利贞。勿用有攸往，利建侯。","初九：磐桓，利居贞，利建侯。","六二：屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字","六三：既鹿无虞，惟入于林中，君子几，不如舍，往吝。","六四：乘马班如，求婚媾，往吉，无不利。","九五：屯其膏，小贞吉，大贞凶。","上六：乘马班如，泣血涟如。","象曰：。","文言曰：。", ""),
    "010001": (4,"蒙卦","蒙,亨。柔蓄而志行，故亨。","初六：发蒙，利用刑人，用说桎梏，以往吝。","九二：包蒙吉，纳妇吉。","六三：勿用勉强，往吝。","六四：困蒙，吝。","六五：童蒙，吉。","上九：击蒙，不利为寇，利御寇。","象曰：山下有风，蒙。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111010": (5,"需卦","需,亨。柔蓄而志行，故亨。","初九：需于郊，利用恒。","六二：需于沙，小有言，终吉。","六三：需于泥，致寇至。","六四：需于血，出自穴。","六五：需于酒食，贞吉。","上九：入于穴，有不速之客三人来，敬之终吉。","象曰：天在上，地在下，需。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010111": (6,"讼卦","讼,亨。柔蓄而志行，故亨。","初六：不永所事，小有言，终吉。","九二：不永所事，小有言，终吉。","六三：不永所事，小有言，终吉。","六四：不永所事，小有言，终吉。","六五：不永所事，小有言，终吉。","上九：不永所事，小有言，终吉。","象曰：天在上，地在下，讼。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010000": (7,"师卦","师,亨。柔蓄而志行，故亨。","初六：师出以律，利有攸往。","九二：师出以律，利有攸往。","六三：师出以律，利有攸往。","六四：师出以律，利有攸往。","六五：师出以律，利有攸往。","上九：师出以律，利有攸往。","象曰：天在上，地在下，师。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000010": (8,"比卦","比,亨。柔蓄而志行，故亨。","初六：比于郊，利用恒。","六二：比于沙，小有言，终吉。","六三：比于泥，致寇至。","六四：比于血，出自穴。","六五：比于酒食，贞吉。","上九：入于穴，有不速之客三人来，敬之终吉。","象曰：天在上，地在下，比。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111011": (9,"小畜卦","小畜,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，小畜。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110111": (10,"履卦","履,亨。柔蓄而志行，故亨。","初六：履霜，坚冰至。","九二：履霜，坚冰至。","六三：履霜，坚冰至。","六四：履霜，坚冰至。","六五：履霜，坚冰至。","上九：履霜，坚冰至。","象曰：天在上，地在下，履。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111000": (11,"泰卦","泰,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，泰。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000111": (12,"否卦","否,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，否。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101111": (13,"同人卦","同人,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，同人。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111101": (14,"大有卦","大有,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大有。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001000": (15,"谦卦","谦,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，谦。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000100": (16,"豫卦","豫,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，豫。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100110": (17,"随卦","随,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，随。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011001": (18,"蛊卦","蛊,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，蛊。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110000": (19,"临卦","临,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，临。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000011": (20,"观卦","观,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，观。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100101": (21,"噬嗑卦","噬嗑,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，噬嗑。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101001": (22,"贲卦","贲,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，贲。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000001": (23,"剥卦","剥,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，剥。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100000": (24,"复卦","复,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，复。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100111": (25,"无妄卦","无妄,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，无妄。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111001": (26,"大畜卦","大畜,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大畜。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100001": (27,"颐卦","颐,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，颐。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011110": (28,"大过卦","大过,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大过。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010010": (29,"习坎卦","习坎,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，习坎。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101101": (30,"离卦","离,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，离。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001110": (31,"咸卦","咸,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，咸。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011100": (32,"恒卦","恒,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，恒。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001111": (33,"遁卦","遁,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，遁。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111100": (34,"大壮卦","大壮,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大壮。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000101": (35,"晋卦","晋,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，晋。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101000": (36,"明夷卦","明夷,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，明夷。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101011": (37,"家人卦","家人,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，家人。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110101": (38,"睽卦","睽,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，睽。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001010": (39,"蹇卦","蹇,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，蹇。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010100": (40,"解卦","解,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，解。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110001": (41,"损卦","损,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，损。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100011": (42,"益卦","益,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，益。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111110": (43,"夬卦","夬,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，夬。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011111": (44,"姤卦","姤,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，姤。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000110": (45,"萃卦","萃,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，萃。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011000": (46,"升卦","升,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，升。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010110": (47,"困卦","困,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，困。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011010": (48,"井卦","井,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，井。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101110": (49,"革卦","革,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，革。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011101": (50,"鼎卦","鼎,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，鼎。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100100": (51,"震卦","震,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，震。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001001": (52,"艮卦","艮,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，艮。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001011": (53,"渐卦","渐,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，渐。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110100": (54,"归妹卦","归妹,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，归妹。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101100": (55,"丰卦","丰,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，丰。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001101": (56,"旅卦","旅,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，旅。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011011": (57,"巽卦","巽,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，巽。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110110": (58,"兑卦","兑,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，兑。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010011": (59,"涣卦","涣,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，涣。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110010": (60,"节卦","节,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，节。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110011": (61,"中孚卦","中孚,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，中孚。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001100": (62,"小过卦","小过,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，小过。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101010": (63,"既济卦","既济,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，既济。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010101": (64,"未济卦","未济,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，未济。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),

    "default": ("未找到该卦信息",),
}


def JieGua(GuaXiangData,FuGuaData,BianGuaData,HuGuaData,YaoWeiData):
    print(SixtyFourGua["menu"])
    if GuaXiangData in SixtyFourGua:
        print(f"卦象：{SixtyFourGua[GuaXiangData]} \n 爻位：{SixtyFourGua[GuaXiangData][YaoWeiData+3]}")
        DrawTheGua(GuaXiangData)
    else:
        print (f"卦象{SixtyFourGua.get(GuaXiangData, SixtyFourGua["default"])}")
        DrawTheGua(GuaXiangData)
    '''
    if FuGuaData in SixtyFourGua:
        print(f"覆卦：{SixtyFourGua.get(FuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(FuGuaData)
    else:
        print(f"覆卦：{SixtyFourGua.get(FuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(FuGuaData)
    
    if BianGuaData in SixtyFourGua:
        print(f"变卦：{SixtyFourGua.get(BianGuaData, SixtyFourGua["default"])}")
        DrawTheGua(BianGuaData)
    else:
        print(f"变卦：{SixtyFourGua.get(BianGuaData, SixtyFourGua["default"])}")
        DrawTheGua(BianGuaData)
    
    if HuGuaData in SixtyFourGua:
        print(f"互卦：{SixtyFourGua.get(HuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(HuGuaData)
    else:
        print(f"互卦：{SixtyFourGua.get(HuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(HuGuaData)
    '''

    return None

def DrawTheGua(GuaData):
    print("Drawing the Gua...")
    for i in range(5, -1, -1):  # Loop from 5 to 0 (5 lines)
        if GuaData[i] == '1':
            print("—————", end='\n')  # Yang line
        else:
            print("—— ——", end='\n')  # Yin line
    print()  # New line after drawing the Gua