SixtyFourGua = {
    "menu": ("次序","卦名","卦辞","初爻辞","二爻辞","三爻辞","四爻辞","五爻辞","上爻辞","象","文言","主爻"),
    "111111": (1,"乾卦","乾,元亨利贞","初九：潜龙勿用。","九二：见龙在田，利见大人。","九三：君子终日乾乾，夕惕若厉，无敢尚词。","九四：或跃在渊，无咎。","九五：飞龙在天，利见大人。","上九：亢龙有悔。","象曰：天行健，君子以自强不息。","文言曰：元亨利贞。", ""),
    "000000": (2,"坤卦","坤,元亨,利牝马之贞。君子有攸往，先迷后得主。利西南得朋，东北丧朋。安贞吉","初六：履霜，坚冰至。","六二：直方大，不习,无不利。","六三：含章可贞，或从王事，无成有终。","六四：括囊，无咎。","六五：黄裳，元吉。","上六：龙战于野，其血玄黄。","象曰：地势坤，君子以厚德载物。","文言曰：元亨利贞。", ""),
    "100010": (3,"屯卦","屯,元亨利贞。勿用有攸往，利建侯。","初九：磐桓，利居贞，利建侯。","六二：屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字","六三：既鹿无虞，惟入于林中，君子几，不如舍，往吝。","六四：乘马班如，求婚媾，往吉，无不利。","九五：屯其膏，小贞吉，大贞凶。","上六：乘马班如，泣血涟如。","象曰：。","文言曰：。", ""),
    "010001": (4,"蒙卦","蒙,亨。柔蓄而志行，故亨。","初六：发蒙，利用刑人，用说桎梏，以往吝。","九二：包蒙吉，纳妇吉。","六三：勿用勉强，往吝。","六四：困蒙，吝。","六五：童蒙，吉。","上九：击蒙，不利为寇，利御寇。","象曰：山下有风，蒙。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111010": (5,"需卦","需,亨。柔蓄而志行，故亨。","初九：需于郊，利用恒。","六二：需于沙，小有言，终吉。","六三：需于泥，致寇至。","六四：需于血，出自穴。","六五：需于酒食，贞吉。","上九：入于穴，有不速之客三人来，敬之终吉。","象曰：天在上，地在下，需。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010111": (6,"讼卦","讼,亨。柔蓄而志行，故亨。","初六：不永所事，小有言，终吉。","九二：不永所事，小有言，终吉。","六三：不永所事，小有言，终吉。","六四：不永所事，小有言，终吉。","六五：不永所事，小有言，终吉。","上九：不永所事，小有言，终吉。","象曰：天在上，地在下，讼。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010000": (7,"师卦","师,亨。柔蓄而志行，故亨。","初六：师出以律，利有攸往。","九二：师出以律，利有攸往。","六三：师出以律，利有攸往。","六四：师出以律，利有攸往。","六五：师出以律，利有攸往。","上九：师出以律，利有攸往。","象曰：天在上，地在下，师。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000010": (8,"比卦","比,亨。柔蓄而志行，故亨。","初六：比于郊，利用恒。","六二：比于沙，小有言，终吉。","六三：比于泥，致寇至。","六四：比于血，出自穴。","六五：比于酒食，贞吉。","上九：入于穴，有不速之客三人来，敬之终吉。","象曰：天在上，地在下，比。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111011": (9,"小畜卦","小畜,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，小畜。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110111": (10,"履卦","履,亨。柔蓄而志行，故亨。","初六：履霜，坚冰至。","九二：履霜，坚冰至。","六三：履霜，坚冰至。","六四：履霜，坚冰至。","六五：履霜，坚冰至。","上九：履霜，坚冰至。","象曰：天在上，地在下，履。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111000": (11,"泰卦","泰,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，泰。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000111": (12,"否卦","否,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，否。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101111": (13,"同人卦","同人,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，同人。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111101": (14,"大有卦","大有,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大有。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001000": (15,"谦卦","谦,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，谦。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000100": (16,"豫卦","豫,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，豫。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100110": (17,"随卦","随,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，随。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011001": (18,"蛊卦","蛊,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，蛊。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110000": (19,"临卦","临,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，临。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000011": (20,"观卦","观,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，观。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100101": (21,"噬嗑卦","噬嗑,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，噬嗑。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101001": (22,"贲卦","贲,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，贲。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000001": (23,"剥卦","剥,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，剥。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100000": (24,"复卦","复,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，复。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100111": (25,"无妄卦","无妄,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，无妄。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111001": (26,"大畜卦","大畜,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大畜。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100001": (27,"颐卦","颐,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，颐。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011110": (28,"大过卦","大过,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大过。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010010": (29,"习坎卦","习坎,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，习坎。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101101": (30,"离卦","离,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，离。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001110": (31,"咸卦","咸,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，咸。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011100": (32,"恒卦","恒,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，恒。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001111": (33,"遁卦","遁,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，遁。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111100": (34,"大壮卦","大壮,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，大壮。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000101": (35,"晋卦","晋,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，晋。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101000": (36,"明夷卦","明夷,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，明夷。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101011": (37,"家人卦","家人,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，家人。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110101": (38,"睽卦","睽,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，睽。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001010": (39,"蹇卦","蹇,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，蹇。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010100": (40,"解卦","解,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，解。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110001": (41,"损卦","损,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，损。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100011": (42,"益卦","益,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，益。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "111110": (43,"夬卦","夬,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，夬。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011111": (44,"姤卦","姤,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，姤。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "000110": (45,"萃卦","萃,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，萃。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011000": (46,"升卦","升,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，升。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010110": (47,"困卦","困,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，困。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011010": (48,"井卦","井,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，井。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101110": (49,"革卦","革,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，革。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011101": (50,"鼎卦","鼎,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，鼎。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "100100": (51,"震卦","震,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，震。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001001": (52,"艮卦","艮,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，艮。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001011": (53,"渐卦","渐,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，渐。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110100": (54,"归妹卦","归妹,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，归妹。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101100": (55,"丰卦","丰,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，丰。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001101": (56,"旅卦","旅,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，旅。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "011011": (57,"巽卦","巽,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，巽。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110110": (58,"兑卦","兑,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，兑。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010011": (59,"涣卦","涣,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，涣。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110010": (60,"节卦","节,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，节。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "110011": (61,"中孚卦","中孚,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，中孚。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "001100": (62,"小过卦","小过,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，小过。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "101010": (63,"既济卦","既济,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，既济。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),
    "010101": (64,"未济卦","未济,亨。柔蓄而志行，故亨。","初九：小畜，利有攸往。","九二：小畜，利有攸往。","六三：小畜，利有攸往。","六四：小畜，利有攸往。","六五：小畜，利有攸往。","上九：小畜，利有攸往。","象曰：天在上，地在下，未济。君子以懿文德。","文言曰：亨。柔蓄而志行，故亨。", ""),

    "default": ("未找到该卦信息",),
}


def JieGua(GuaXiangData,FuGuaData,BianGuaData,HuGuaData,YaoWeiData):
    print(SixtyFourGua["menu"])
    if GuaXiangData in SixtyFourGua:
        print(f"卦象：{SixtyFourGua[GuaXiangData]} \n 爻位：{SixtyFourGua[GuaXiangData][YaoWeiData+3]}")
        DrawTheGua(GuaXiangData)
    else:
        print (f"卦象{SixtyFourGua.get(GuaXiangData, SixtyFourGua["default"])}")
        DrawTheGua(GuaXiangData)
    '''
    if FuGuaData in SixtyFourGua:
        print(f"覆卦：{SixtyFourGua.get(FuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(FuGuaData)
    else:
        print(f"覆卦：{SixtyFourGua.get(FuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(FuGuaData)
    
    if BianGuaData in SixtyFourGua:
        print(f"变卦：{SixtyFourGua.get(BianGuaData, SixtyFourGua["default"])}")
        DrawTheGua(BianGuaData)
    else:
        print(f"变卦：{SixtyFourGua.get(BianGuaData, SixtyFourGua["default"])}")
        DrawTheGua(BianGuaData)
    
    if HuGuaData in SixtyFourGua:
        print(f"互卦：{SixtyFourGua.get(HuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(HuGuaData)
    else:
        print(f"互卦：{SixtyFourGua.get(HuGuaData, SixtyFourGua["default"])}")
        DrawTheGua(HuGuaData)
    '''

    return None

def DrawTheGua(GuaData):
    print("Drawing the Gua...")
    for i in range(5, -1, -1):  # Loop from 5 to 0 (5 lines)
        if GuaData[i] == '1':
            print("—————", end='\n')  # Yang line
        else:
            print("—— ——", end='\n')  # Yin line
    print()  # New line after drawing the Gua